In [1]:
import numpy as np
import pandas as pd

In [2]:
raw_data = {'ID'        :['100',     '101',   '102',   '103',      '104',   '106',    '108',   '110',   '111',      '113'],
            'City'      :['Tokyo',   'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo', 'Tokyo',  'Osaka', 'Kyoto', 'Hokkaido', 'Tokyo'],
            'Birth_year':[1990,      1989,    1992,    1997,       1982,    1991,     1988,    1990,    1995,       1981],
            'Name'      :['Hiroshi', 'Akiki', 'Yuki',  'Satoru',   'Steve', 'Mituru', 'Aoi',   'Tarou', 'Suguru',   'Mitsuo']}
table = pd.DataFrame(data=raw_data)
table

    ID      City  Birth_year     Name
0  100     Tokyo        1990  Hiroshi
1  101     Osaka        1989    Akiki
2  102     Kyoto        1992     Yuki
3  103  Hokkaido        1997   Satoru
4  104     Tokyo        1982    Steve
5  106     Tokyo        1991   Mituru
6  108     Osaka        1988      Aoi
7  110     Kyoto        1990    Tarou
8  111  Hokkaido        1995   Suguru
9  113     Tokyo        1981   Mitsuo

### 分箱(手動劃分)

In [3]:
bins = [1980, 1985, 1990, 1995, 2000]
group1 = pd.cut(table['Birth_year'], bins)
group1

0    (1985, 1990]
1    (1985, 1990]
2    (1990, 1995]
3    (1995, 2000]
4    (1980, 1985]
5    (1990, 1995]
6    (1985, 1990]
7    (1985, 1990]
8    (1990, 1995]
9    (1980, 1985]
Name: Birth_year, dtype: category
Categories (4, interval[int64]): [(1980, 1985] < (1985, 1990] < (1990, 1995] < (1995, 2000]]

In [4]:
labels = ['group1', 'group2', 'group3', 'group4']
group2 = pd.cut(table['Birth_year'], bins, labels=labels)
group2

0    group2
1    group2
2    group3
3    group4
4    group1
5    group3
6    group2
7    group2
8    group3
9    group1
Name: Birth_year, dtype: category
Categories (4, object): ['group1' < 'group2' < 'group3' < 'group4']

In [5]:
pd.concat([table['Birth_year'], group1, group2], axis=1)

  Birth_year    Birth_year Birth_year
0       1990  (1985, 1990]     group2
1       1989  (1985, 1990]     group2
2       1992  (1990, 1995]     group3
3       1997  (1995, 2000]     group4
4       1982  (1980, 1985]     group1
5       1991  (1990, 1995]     group3
6       1988  (1985, 1990]     group2
7       1990  (1985, 1990]     group2
8       1995  (1990, 1995]     group3
9       1981  (1980, 1985]     group1

### 分箱(自動劃分)

In [6]:
pd.cut(table['Birth_year'], 2)

0      (1989.0, 1997.0]
1    (1980.984, 1989.0]
2      (1989.0, 1997.0]
3      (1989.0, 1997.0]
4    (1980.984, 1989.0]
5      (1989.0, 1997.0]
6    (1980.984, 1989.0]
7      (1989.0, 1997.0]
8      (1989.0, 1997.0]
9    (1980.984, 1989.0]
Name: Birth_year, dtype: category
Categories (2, interval[float64]): [(1980.984, 1989.0] < (1989.0, 1997.0]]

### 計數

In [7]:
pd.value_counts(group1)

(1985, 1990]    4
(1990, 1995]    3
(1980, 1985]    2
(1995, 2000]    1
Name: Birth_year, dtype: int64

In [8]:
pd.value_counts(group2)

group2    4
group3    3
group1    2
group4    1
Name: Birth_year, dtype: int64